package com.simorgh.mahbanoo.View.main;

import android.graphics.Typeface;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.simorgh.cycleview.CycleView;
import com.simorgh.mahbanoo.R;

import org.sufficientlysecure.htmltextview.HtmlTextView;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;

public class CycleInfoFragment extends Fragment {

    private final static String yellowInfoString = "<h5><p> سندرم پیش قاعدگی(PMS) </p></h5>\n" +
            "        <h6><p>پیش از ان که دوره ی قاعدگی شما اغاز گردد تغییراتی همچون فیزیکی، عاطفی یا رفتاری در شما پدید می آید که پس از آغاز دوره ی قاعدگی، آنها از بین می روند. این نشانه ها برای خانم ها متفاوت می باشد</p></h6>\n" +
            "                \n" +
            "        <h5><p>برخی از نشانه های فیزیکی:   </p></h5>\n" +
            "        <h6><p>متورم شدن شکم، دست ها و پاها</p></h6>\n" +
            "        <h6><p>گرفتگی و دردهای عضلانی</p></h6>\n" +
            "        <h6><p>حساسیت سینه ها </p></h6>\n" +
            "        <h6><p>احساس گرسنگی</p></h6>\n" +
            "        <h6><p>سردرد</p></h6>\n" +
            "        <h6><p>جوش زدن</p></h6>\n" +
            "        <h6><p>افزایش وزن</p></h6>\n" +
            "        <h6><p>یبوست یا اسهال</p></h6>\n" +
            "        \n" +
            "                \n" +
            "        <h5><p> علائم عاطفی </p></h5>\n" +
            "        <h6><p>فشار یا اضطراب</p></h6>\n" +
            "        <h6><p>افسردگی</p></h6>\n" +
            "        <h6><p>گریان</p></h6>\n" +
            "        <h6><p>نوسانات اخلاقی</p></h6>\n" +
            "        <h6><p>نخوابیدن</p></h6>\n" +
            "        <h6><p>دورشدن از اجتماع</p></h6>\n" +
            "        <h6><p>احساس سرخوردگی</p></h6>\n" +
            "        <h6><p>تیک های  عصبی</p></h6>\n" +
            "                \n" +
            "        <h5><p>نشانه های رفتاری  </p></h5>\n" +
            "        <h6><p>فراموش کاری</p></h6>\n" +
            "        <h6><p>از دست دادن تمرکز ذهنی</p></h6>\n" +
            "        <h6><p>خستگی</p></h6>\n" +
            "\n" +
            "        <h5><p> توصیه\u200Cهایی برای کنترل نسبی سندرم پیش از قاعدگی </p></h5>\n" +
            "        <h6><p>از خانواده و دوستان خود در این مواقع کمک بگیرید.</p></h6>\n" +
            "        <h6><p>اگر با تغییر سبک زندگی بهبودی حاصل نشد لازم است برای کاهش علائم به پزشک مراجعه کنید.</p></h6>\n" +
            "        <h6><p>اغلب ترکیبی از تغییر سبک زندگی، درمان\u200Cهای طبیعی و درمان\u200Cهای دارویی نتیجه بهتری دارند.</p></h6>\n" +
            "        <h6><p>در یک تقویم علائم اولیه روحی و احساسات و علائم فیزیکی غیرمعمول خود را در هر روز برای حداقل دو ماه ثبت کنید. در همان تقویم روزهای شروع علائم و پایان آن و شروع خونریزی قاعدگی را نیز ثبت کنید. این کار به پزشک در درک  شیوع علائم و الگوی علائم کمک می\u200Cکند.</p></h6>\n" +
            "        <h6><p>اگر علائم خلقی یا سایر علائم در طول دو هفته قبل از خونریزی بعدی شروع شد احتمالاً شما مبتلا به PMS هستید و اگر این علائم را در تمام طول ماه داشتید احتمالاً دلیل دیگری غیر از PMS وجود دارد.</p></h6>\n" +
            "        <h6><p>قبل از مصرف هر گونه داروی گیاهی حتماً با پزشک مشورت کنید.</p></h6>\n" +
            "        <h6><p>غذاهای مفید در درمان PMS را امتحان کنید که شامل این موارد است: آووکادو، برنج قهوه\u200Cای، خربزه، فلفل، موز، تخم\u200Cمرغ، دانه\u200Cها (تخم آفتابگردان، کدوتنبل)، سبزیجات برگ سبز (اسفناج، کلم پیچ و...)، روغن ماهی و گردو.</p></h6>\n" +
            "             ";
    private Typeface typeface;
    private final static String redString = "<h5><p> پریود یا قاعدگی چیست؟</p></h5>\n" +
            "        <h6><p> قاعدگی یا عادت ماهانه، به جاری شدن خون از پوشش داخلی رحم گفته می\u200Cشود؛ که به\u200Cطور منظم از اوایل سنین جوانی، در دوران بلوغ تا دوران یائسگی رخ می\u200Cدهد. به\u200Cطور معمول عادت ماهانه در زنان باردار و شیرده اتفاق نمی\u200Cافتد.</p></h6>\n" +
            "        <h6><p>مدت خون\u200Cریزی پریود یا قاعدگی برای چندروز، معمولاً ۳–۵ روز طول می\u200Cکشد، اما بین۲–۷ روز نیز می\u200Cتواند متغیر باشد. هر سیکل قاعدگی به\u200Cطور متوسط ۲۸ روز طول می\u200Cکشد، یک سیکل قاعدگی طبیعی بین ۲۱ تا ۳۵ روز متغیر است. حجم متوسط خون\u200Cریزی در هر سیکل ماهانه قاعدگی ۳۵ میلی\u200Cلیتر است. </p></h6>\n" +
            "        <h5><p>در طول چرخه قاعدگی چه اتفاقی می افتد؟ </p></h5>\n" +
            "        <h6><p>در نیمه اول چرخه، سطح استروژن(هورمونی زنانه) شروع به افزایش می کند. استروژن نقش مهمی را در سلامتی شما از طریق کمک کردن به ساختن استخوان های قوی و مستحکم نگه داشتن آن ها با بالا رفتن سنتان، ایفا می کند. استروژن همچنین باعث می شود دیواره های داخلی رحم رشد کرده و ضخیم تر شوند. این دیواره های رحم مکانی هستند که در صورت حاملگی تغذیه جنین را به عهده می گیرند. همچنین با رشد دیواره های رحم، یک سلول تخم در یکی از تخمدان ها شروع به رسیدن می کند. در حدود روز چهاردهم از چرخه ۲۸ روزه، تخم، تخمدان را ترک کرده و این تخمک گذاری نامیده می شود. </p></h6>\n" +
            "        <h6><p> بعد از اینکه تخم، تخمدان را ترک کرد، از طریق لوله های فالوپ در رحم حرکت را آغاز می کند. سطوح هورمون ها افزایش یافته و به دیواره رحم کمک می کنند تا برای حاملگی آماده شود. زنان ممکن است اغلب ۳ روز قبل و یا همان روز تخمک گذاری حامله شوند. به یاد داشته باشید زنانی که دارای چرخه های قاعدگی کوتاه تر و یا بلند تر از ۲۸ روز هستند ممکن است قبل و یا بعد از چهاردهم تخمک گذاری کنند.</p></h6>\n" +
            "        <h6><p>در صورتیکه تخمک با اسپرم برخورد نداشته باشد – مسأله\u200Cای که در اکثر دروه\u200Cهای قاعدگی اتفاق می\u200Cافتد- تخمک بارور نمی\u200Cشود و از بدن دفع می\u200Cشود. در این صورت رحم که خود را آماده پذیرایی از تخم بارور کرده بود، با تشکیل نشدن تخم (بارور نشدن تخمک) به حالت اول خود برمی\u200Cگردد و برای این کار مخاطات و بافت اضافی رحم شروع به ریزش می\u200Cکند. </p></h6>\n" +
            "        <h6><p>ریزش بافت و مخاطات که خونی است همان خونریزی قاعدگی است. باید توجه کرد که خونریزی قاعدگی فقط شامل خون نیست بلکه بافت اضافی و مخاطات خونی است که از رحم به بیرون ریخته می\u200Cشود. </p></h6>\n" +
            "        \n";
    private final static String greenString = " <h5><p> تخمک گذاری </p></h5>\n" +
            "        <h6><p>دوره ی تخمک گذاری زمانی است که یک تخمک بالغ از تخمدان آزاد شده و لوله رحمی را تحت فشار قرار می دهد و در دسترس برای بارور شدن است. تقریبا هر ماه یک تخمک در یکی از تخمدان ها رشد می کند و پس از بلوغ  توسط تخمدان آزاد می شود.</p></h6>\n" +
            "                \n" +
            "        <h4><p> نشانه هایی که بدن در حال تخمک گذاری است </p></h4>\n" +
            "        <h5><p>  افزایش ترشحات واژن </p></h5>\n" +
            "        <h6><p>زمانی که بدن تخمک گذاری می کند میزان ترشحات واژن افزایش می یابد. زنان بسیاری در میانه دوره ی قاعدگی خود حس می کنند که رطوبت واژن آن ها بیشتر شده است. برخی زنان حس می کنند نیاز است از پدهای بهداشتی کوچک استفاده کنند تا خشک بمانند. در این زمان رابطه ی جنسی اغلب برای شما ساده تر خواهد بود و نیازی ندارید از لوبرکانت ها استفاده کنید. </p></h6>\n" +
            "                \n" +
            "        \n" +
            "        <h5><p> دهانه ی رحم به سمت جلو آمده است  </p></h5>\n" +
            "        <h6><p>شما می توانید به سادگی محل دهانه ی رحم خود را چک کنید. دست هایتان را شسته و یک یا دو انگشت را داخل واژن کنید، دهانه ی رحم را حس خواهید کرد. زمانی که تخمک گذاری نداشته باشید متوجه می شوید دهانه ی رحم سخت تر بوده و باز نیست. سفتی دهانه ی رحم شما مانند انتهای بینی تان خواهد بود. در زمان تخمک گذاری دسترسی به دهانه ی رحم ساده تر است، همچنین کمی نرم تر و بازتر می باشد تا اسپرم بتواند از آن عبور کند. </p></h6>\n" +
            "                \n" +
            "        <h5><p> درد یک طرفه در زمان تخمک گذاری  </p></h5>\n" +
            "        <h6><p>این حس دردی است که قبل یا همزمان با تخمک گذاری در تخمدان ها ایجاد می شود. برخی زنان درد کمی دارند و برخی درد شدیدتری را تجربه می کنند. همه ی زنان متوجه این درد نخواهند شد. اما احساس این درد نشانه ی خوبی است تا نتیجه بگیرید که شما تخمک گذاری می کنید. </p></h6>\n" +
            "                \n" +
            "        <h5><p> دمای پایه ی بدن تغییر می کند  </p></h5>\n" +
            "        <h6><p>اگر دمای بدن خود را مرتب اندازه گیری کنید می بینید دمای بدنتان پایین آمده و باز ناگهان بالا می رود. این نشانه ای از تخمک گذاری است. برای نتیجه گیری از روی دمای بدن باید هر روز دمای بدن خود را اندازه گیری کنید. </p></h6>\n" +
            "                \n" +
            "        <h5><p> اندازه گیری میزان LH  </p></h5>\n" +
            "        <h6><p>برای این کار باید از تست های پیش بینی تخمک گذاری استفاده کنید. برای این کار باید هزینه ای را صرف خرید یک کیت اندازه گیری کنید تا میزان LH در ادرار شما مشخص شود. این کیت ها برای کسانی که دوره های نامنظم دارند و علائم دیگر را حس نمی کنند مفید هستند.</p></h6>\n" +
            "                \n" +
            "        \n" +
            "        <h5><p> برخی از حقایق که در ارتباط با تخمک و تخمک گذاری: </p></h5>\n" +
            "        <h6><p>هر تخمک بعد از 12  الی 24 بعد از ازاد شدن ، زنده می ماند.</p></h6>\n" +
            "        <h6><p>در هر ماه تنها یک تخمک ازاد می گردد.</p></h6>\n" +
            "        <h6><p>تخمک گذاری می تواند تحت تاثیر استرس، مریضی و غیره باشد.</p></h6>\n" +
            "        <h6><p>برخی از زنان ممکن است در دوره ی تخمک گذاری خون لکه ای و یا نقطه ای مشاهده کنند و همراه با احساس درد باشد. </p></h6>\n" +
            "        <h6><p>حتی اگر یک دوره قاعدگی رخ نداده باشدT تخمک گذاری ممکن است رخ دهد.</p></h6>\n" +
            "        <h6><p>در صورت عدم رهایی تخمک، مجددا به داخل رحم جذب می شود.</p></h6> \n";
    private HtmlTextView tvInfo;

    public static CycleInfoFragment newInstance() {
        return new CycleInfoFragment();
    }

    @Override
    public void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        if (getActivity() != null) {
            typeface = Typeface.createFromAsset(getActivity().getAssets(), "fonts/iransans_medium.ttf");
        }
    }

    @Override
    public View onCreateView(@NonNull LayoutInflater inflater, @Nullable ViewGroup container, @Nullable Bundle savedInstanceState) {
        View v = inflater.inflate(R.layout.cycle_info_fragment, container, false);
        tvInfo = v.findViewById(R.id.tv_info);
        tvInfo.setTypeface(typeface);

        if (getArguments() != null) {
            int dayType;
            String text = "";
            dayType = CycleInfoFragmentArgs.fromBundle(getArguments()).getDayType();
            switch (dayType) {
                case CycleView.TYPE_RED:
                    text = redString;
                    break;
                case CycleView.TYPE_GREEN:
                case CycleView.TYPE_GREEN2:
                    text = greenString;
                    break;
                case CycleView.TYPE_YELLOW:
                    text = yellowInfoString;
                    break;
            }

            tvInfo.setHtml(text);
        }

        return v;
    }

    @Override
    public void onDestroyView() {
        tvInfo = null;
        super.onDestroyView();
    }

    @Override
    public void onActivityCreated(@Nullable Bundle savedInstanceState) {
        super.onActivityCreated(savedInstanceState);
    }

}
